a1 = int(input())#a вводимое число
b1 = a1 - 1# b вычисление предыдущего числа
c1 = a1 + 1# c вычисление следующего числа
print("следующее за числом",a1, 'число:',c1,)
print("для числа",a1, 'предыдущее число:',b1,)
a2 = int(input())#a вводимое число
b2 = a2 - 1# b вычисление предыдущего числа
c2 = a2 + 1# c вычисление следующего числа
print("следующее за числом",a2, 'число:',c2,)
print("для числа",a2, 'предыдущее число:',b2,)
a3 = int(input())#a вводимое число
b3 = a3 - 1# b вычисление предыдущего числа
c3 = a3 + 1# c вычисление следующего числа
print("следующее за числом",a3, 'число:',c3,)
print("для числа",a3, 'предыдущее число:',b3,)